Catalogs/УчетныеЗаписиИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>УчетныеЗаписиИнтеграции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенАвторизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаВнутреннихКлиентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Склады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Валюты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>Валюты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Обозначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Копейки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Comment>удалить</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяВалюта</Name>
					<Comment>Курс считается отностительно базовой валюты</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветРГБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Символ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВИнвойсах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВОплатах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиПартионныйУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбратныйКурс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодISO</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/StockAPI_Справочники/Ext/Module.bsl
// Справочники StockAPI: форматирование кодов, поиск фирмы/склада/контрагента, списки складов и валют.

// Поиск склада: сначала из запроса, затем склад фирмы, затем первый доступный склад.  
//
Функция НайтиСклад(ДанныеЗапроса, УчетнаяЗапись, Ошибка) Экспорт
	
	Если ДанныеЗапроса.Свойство("warehouse") И СокрЛП(ДанныеЗапроса.warehouse) <> "" Тогда 
		
		Запр = Новый Запрос;
		Запр.Текст = "ВЫБРАТЬ
		             |	Склады.Склад КАК Склад
		             |ИЗ
		             |	Справочник.УчетныеЗаписиИнтеграции.Склады КАК Склады
		             |ГДЕ
		             |	Склады.Ссылка = &УчетнаяЗапись
		             |	И Склады.Склад.Наименование = &ШаблонПоиска";
		Запр.УстановитьПараметр("УчетнаяЗапись",	УчетнаяЗапись);
		Запр.УстановитьПараметр("ШаблонПоиска", 	ДанныеЗапроса.warehouse); 
		РезультатЗапроса = Запр.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Ошибка = СтрШаблон("Не найден склад '%1'.", ДанныеЗапроса.warehouse);
			Возврат Справочники.Склады.ПустаяСсылка();
		Иначе
			Выборка = РезультатЗапроса.Выбрать();	
			Выборка.Следующий(); 
			Возврат Выборка.Склад;   
		КонецЕсли;
		
	Иначе
		
		Ошибка = "Укажите warehouse (наименование склада).";
		Возврат Справочники.Склады.ПустаяСсылка();
		
	КонецЕсли;
	
КонецФункции

// GET /warehouses — список складов с фильтрацией по доступу, поиску, коду.
//
Функция ПолучитьСписокСкладов(ЗапросАПИ) Экспорт
	
	СтрокаПоиска = "";
	ПараметрПоиска = ЗапросАПИ.ПараметрыЗапроса.Получить("search");
	Если ПараметрПоиска <> Неопределено Тогда
		СтрокаПоиска = СокрЛП(ПараметрПоиска);
	КонецЕсли;
	ШаблонПоиска = ?(ЗначениеЗаполнено(СтрокаПоиска), "%" + СтрокаПоиска + "%", "");
	
	СтрокаКода = "";
	ПараметрКода = ЗапросАПИ.ПараметрыЗапроса.Получить("warehouseCode");
	Если ПараметрКода = Неопределено Тогда
		ПараметрКода = ЗапросАПИ.ПараметрыЗапроса.Получить("code");
	КонецЕсли;
	Если ПараметрКода <> Неопределено Тогда
		СтрокаКода = СокрЛП(Строка(ПараметрКода));
	КонецЕсли; 
	Если ЗначениеЗаполнено(СтрокаКода) Тогда
		КодЧисло = Число(СтрокаКода);
	Иначе
		КодЧисло = Неопределено;
	КонецЕсли;
	
	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
	             |	Склады.Склад.Наименование КАК Наименование,
	             |	Склады.Склад.НаименованиеАнгл КАК НаименованиеАнгл,
	             |	Склады.Склад.Код КАК Код
	             |ИЗ
	             |	Справочник.УчетныеЗаписиИнтеграции.Склады КАК Склады
	             |ГДЕ
	             |	Склады.Ссылка.ТокенАвторизации = &ТокенАвторизации
	             |	И ВЫБОР
	             |			КОГДА &ШаблонПоиска = """"
	             |				ТОГДА ИСТИНА
	             |			ИНАЧЕ Склады.Склад.Наименование ПОДОБНО &ШаблонПоиска
	             |		КОНЕЦ
	             |	И ВЫБОР
	             |			КОГДА &Код = НЕОПРЕДЕЛЕНО
	             |				ТОГДА ИСТИНА
	             |			ИНАЧЕ Склады.Склад.Код = &Код
	             |		КОНЕЦ";
	Запр.УстановитьПараметр("ТокенАвторизации", ЗапросАПИ.Заголовки.Получить("X-Api-Key"));
	Запр.УстановитьПараметр("ШаблонПоиска", 	ШаблонПоиска);
	Запр.УстановитьПараметр("Код", 				КодЧисло);
	
	//StockAPI_Утилиты.ЗаписатьВПротокол(ЗапросАПИ, 
	//									СтрШаблон("ШаблонПоиска: %1, БезПоиска: %2, Код: %3, БезКода: %4", ШаблонПоиска, БезПоиска, СтрокаКода, БезКода),
	//									Справочники.УчетныеЗаписиИнтеграции.НайтиПоРеквизиту("ТокенАвторизации", ЗапросАПИ.Заголовки.Получить("X-Api-Key")),
	//									0,
	//									"");                                                      
	//////ТекстПротокола = СтрШаблон("ШаблонПоиска: %1, БезПоиска: %2, Код: %3, БезКода: %4, ТокенАвторизации: %5", ШаблонПоиска, БезПоиска, СтрокаКода, БезКода, ЗапросАПИ.Заголовки.Получить("X-Api-Key"));
	//////ЗаписьЖурналаРегистрации("StockAPI.Протоколирование", УровеньЖурналаРегистрации.Информация,,, ТекстПротокола);
	
	Таблица = Запр.Выполнить().Выгрузить();
	Массив = Новый Массив;
	
	Для Каждого Стр Из Таблица Цикл
		Элемент = Новый Структура;
		Элемент.Вставить("warehouse", 		Стр.Наименование);
		Элемент.Вставить("warehouseEn", 	Стр.НаименованиеАнгл);
		Элемент.Вставить("warehouseCode", 	StockAPI_Утилиты.КодВСтроку(Стр.Код));
		Массив.Добавить(Элемент);
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

// + GET /currencies — список валют с фильтрацией по поиску и коду.    
//
Функция ПолучитьСписокВалют(ЗапросАПИ) Экспорт
	
	СтрокаПоиска = "";
	ПараметрПоиска = ЗапросАПИ.ПараметрыЗапроса.Получить("search");
	Если ПараметрПоиска <> Неопределено Тогда
		СтрокаПоиска = СокрЛП(ПараметрПоиска);
	КонецЕсли;
	ШаблонПоиска = ?(ЗначениеЗаполнено(СтрокаПоиска), "%" + СтрокаПоиска + "%", "");

	СтрокаКода = "";
	ПараметрКода = ЗапросАПИ.ПараметрыЗапроса.Получить("currencyCode");
	Если ПараметрКода = Неопределено Тогда
		ПараметрКода = ЗапросАПИ.ПараметрыЗапроса.Получить("code");
	КонецЕсли;
	Если ПараметрКода <> Неопределено Тогда
		СтрокаКода = СокрЛП(Строка(ПараметрКода));
	КонецЕсли; 
	Если ЗначениеЗаполнено(СтрокаКода) Тогда
		КодЧисло = Число(СтрокаКода);
	Иначе
		КодЧисло = Неопределено;
	КонецЕсли;
	
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	Вал.КодISO КАК Код,
	            |	Вал.Наименование КАК currency,
	            |	Вал.Символ КАК Символ
	            |ИЗ
	            |	Справочник.Валюты КАК Вал
	            |ГДЕ
	            |	НЕ Вал.ПометкаУдаления
	            |	И ВЫБОР
	            |			КОГДА &ШаблонПоиска = """"
	            |				ТОГДА ИСТИНА
	            |			ИНАЧЕ Вал.Наименование ПОДОБНО &ШаблонПоиска
	            |		КОНЕЦ
	            |	И ВЫБОР
	            |			КОГДА &Код = НЕОПРЕДЕЛЕНО
	            |				ТОГДА ИСТИНА
	            |			ИНАЧЕ Вал.КодISO = &Код
	            |		КОНЕЦ
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	Вал.Наименование";
	Зап.УстановитьПараметр("ШаблонПоиска", 	ШаблонПоиска);
	Зап.УстановитьПараметр("Код", 			КодЧисло);
	
	Выборка  = Зап.Выполнить().Выбрать();
	Массив = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Элемент = Новый Структура;
		Элемент.Вставить("currencyCode", 	СокрЛП(Выборка.Код));
		Элемент.Вставить("currency", 		Строка(Выборка.currency));
		//Элемент.Вставить("symbol", 		Строка(Выборка.symbol));
		Элемент.Вставить("sign", 			Строка(Выборка.Символ));
		Массив.Добавить(Элемент);
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции
